lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/*
 * File:           C:\Google Disk\USBAudioADAU1772\sigmaDSP1772\sigmaDSP1772_IC_1_REG.h
 *
 * Created:        Thursday, April 21, 2016 9:23:29 PM
 * Description:    sigmaDSP1772:IC 1 control register definitions.
 *
 * This software is distributed in the hope that it will be useful,
 * but is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
 * CONDITIONS OF ANY KIND, without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * This software may only be used to program products purchased from
 * Analog Devices for incorporation by you into audio products that
 * are intended for resale to audio product end users. This software
 * may not be distributed whole or in any part to third parties.
 *
 * Copyright ©2016 Analog Devices, Inc. All rights reserved.
 */
#ifndef __SIGMADSP1772_IC_1_REG_H__
#define __SIGMADSP1772_IC_1_REG_H__


/* CLK_CONTROL  - Registers (IC 1) */
#define REG_CLK_CONTROL_IC_1_ADDR                 0x0
#define REG_CLK_CONTROL_IC_1_BYTE                 1
#define REG_CLK_CONTROL_IC_1_VALUE                0x7

/* PLL_CTRL0  - Registers (IC 1) */
#define REG_PLL_CTRL0_IC_1_ADDR                   0x1
#define REG_PLL_CTRL0_IC_1_BYTE                   1
#define REG_PLL_CTRL0_IC_1_VALUE                  0x0

/* PLL_CTRL1  - Registers (IC 1) */
#define REG_PLL_CTRL1_IC_1_ADDR                   0x2
#define REG_PLL_CTRL1_IC_1_BYTE                   1
#define REG_PLL_CTRL1_IC_1_VALUE                  0x0

/* PLL_CTRL2  - Registers (IC 1) */
#define REG_PLL_CTRL2_IC_1_ADDR                   0x3
#define REG_PLL_CTRL2_IC_1_BYTE                   1
#define REG_PLL_CTRL2_IC_1_VALUE                  0x0

/* PLL_CTRL3  - Registers (IC 1) */
#define REG_PLL_CTRL3_IC_1_ADDR                   0x4
#define REG_PLL_CTRL3_IC_1_BYTE                   1
#define REG_PLL_CTRL3_IC_1_VALUE                  0x0

/* PLL_CTRL4  - Registers (IC 1) */
#define REG_PLL_CTRL4_IC_1_ADDR                   0x5
#define REG_PLL_CTRL4_IC_1_BYTE                   1
#define REG_PLL_CTRL4_IC_1_VALUE                  0x20

/* PLL_CTRL5  - Registers (IC 1) */
#define REG_PLL_CTRL5_IC_1_ADDR                   0x6
#define REG_PLL_CTRL5_IC_1_BYTE                   0
#define REG_PLL_CTRL5_IC_1_VALUE                  0x1

/* CLKOUT_SEL  - Registers (IC 1) */
#define REG_CLKOUT_SEL_IC_1_ADDR                  0x7
#define REG_CLKOUT_SEL_IC_1_BYTE                  1
#define REG_CLKOUT_SEL_IC_1_VALUE                 0x7

/* REGULATOR  - Registers (IC 1) */
#define REG_REGULATOR_IC_1_ADDR                   0x8
#define REG_REGULATOR_IC_1_BYTE                   1
#define REG_REGULATOR_IC_1_VALUE                  0x1

/* CORE_CONTROL  - Registers (IC 1) */
#define REG_CORE_CONTROL_IC_1_ADDR                0x9
#define REG_CORE_CONTROL_IC_1_BYTE                1
#define REG_CORE_CONTROL_IC_1_VALUE               0x3

/* SLEEP_INST  - Registers (IC 1) */
#define REG_SLEEP_INST_IC_1_ADDR                  0xA
#define REG_SLEEP_INST_IC_1_BYTE                  1
#define REG_SLEEP_INST_IC_1_VALUE                 0x0

/* CORE_ENABLE  - Registers (IC 1) */
#define REG_CORE_ENABLE_IC_1_ADDR                 0xB
#define REG_CORE_ENABLE_IC_1_BYTE                 1
#define REG_CORE_ENABLE_IC_1_VALUE                0x3

/* DBREG0  - Registers (IC 1) */
#define REG_DBREG0_IC_1_ADDR                      0xC
#define REG_DBREG0_IC_1_BYTE                      0
#define REG_DBREG0_IC_1_VALUE                     0x0

/* DBREG1  - Registers (IC 1) */
#define REG_DBREG1_IC_1_ADDR                      0xD
#define REG_DBREG1_IC_1_BYTE                      0
#define REG_DBREG1_IC_1_VALUE                     0x0

/* DBREG2  - Registers (IC 1) */
#define REG_DBREG2_IC_1_ADDR                      0xE
#define REG_DBREG2_IC_1_BYTE                      0
#define REG_DBREG2_IC_1_VALUE                     0x0

/* CORE_IN_MUX_0_1  - Registers (IC 1) */
#define REG_CORE_IN_MUX_0_1_IC_1_ADDR             0xF
#define REG_CORE_IN_MUX_0_1_IC_1_BYTE             1
#define REG_CORE_IN_MUX_0_1_IC_1_VALUE            0x10

/* CORE_IN_MUX_2_3  - Registers (IC 1) */
#define REG_CORE_IN_MUX_2_3_IC_1_ADDR             0x10
#define REG_CORE_IN_MUX_2_3_IC_1_BYTE             1
#define REG_CORE_IN_MUX_2_3_IC_1_VALUE            0x32

/* DAC_SOURCE_0_1  - Registers (IC 1) */
#define REG_DAC_SOURCE_0_1_IC_1_ADDR              0x11
#define REG_DAC_SOURCE_0_1_IC_1_BYTE              1
#define REG_DAC_SOURCE_0_1_IC_1_VALUE             0x10

/* PDM_SOURCE_0_1  - Registers (IC 1) */
#define REG_PDM_SOURCE_0_1_IC_1_ADDR              0x12
#define REG_PDM_SOURCE_0_1_IC_1_BYTE              1
#define REG_PDM_SOURCE_0_1_IC_1_VALUE             0x32

/* SOUT_SOURCE_0_1  - Registers (IC 1) */
#define REG_SOUT_SOURCE_0_1_IC_1_ADDR             0x13
#define REG_SOUT_SOURCE_0_1_IC_1_BYTE             1
#define REG_SOUT_SOURCE_0_1_IC_1_VALUE            0x54

/* SOUT_SOURCE_2_3  - Registers (IC 1) */
#define REG_SOUT_SOURCE_2_3_IC_1_ADDR             0x14
#define REG_SOUT_SOURCE_2_3_IC_1_BYTE             1
#define REG_SOUT_SOURCE_2_3_IC_1_VALUE            0x76

/* SOUT_SOURCE_4_5  - Registers (IC 1) */
#define REG_SOUT_SOURCE_4_5_IC_1_ADDR             0x15
#define REG_SOUT_SOURCE_4_5_IC_1_BYTE             1
#define REG_SOUT_SOURCE_4_5_IC_1_VALUE            0x54

/* SOUT_SOURCE_6_7  - Registers (IC 1) */
#define REG_SOUT_SOURCE_6_7_IC_1_ADDR             0x16
#define REG_SOUT_SOURCE_6_7_IC_1_BYTE             1
#define REG_SOUT_SOURCE_6_7_IC_1_VALUE            0x76

/* ADC_SDATA_CH  - Registers (IC 1) */
#define REG_ADC_SDATA_CH_IC_1_ADDR                0x17
#define REG_ADC_SDATA_CH_IC_1_BYTE                1
#define REG_ADC_SDATA_CH_IC_1_VALUE               0x4

/* ASRCO_SOURCE_0_1  - Registers (IC 1) */
#define REG_ASRCO_SOURCE_0_1_IC_1_ADDR            0x18
#define REG_ASRCO_SOURCE_0_1_IC_1_BYTE            1
#define REG_ASRCO_SOURCE_0_1_IC_1_VALUE           0x10

/* ASRCO_SOURCE_2_3  - Registers (IC 1) */
#define REG_ASRCO_SOURCE_2_3_IC_1_ADDR            0x19
#define REG_ASRCO_SOURCE_2_3_IC_1_BYTE            1
#define REG_ASRCO_SOURCE_2_3_IC_1_VALUE           0x32

