lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* ASRC_MODE  - Registers (IC 1) */
#define REG_ASRC_MODE_IC_1_ADDR                   0x1A
#define REG_ASRC_MODE_IC_1_BYTE                   1
#define REG_ASRC_MODE_IC_1_VALUE                  0x0

/* ADC_CONTROL0  - Registers (IC 1) */
#define REG_ADC_CONTROL0_IC_1_ADDR                0x1B
#define REG_ADC_CONTROL0_IC_1_BYTE                1
#define REG_ADC_CONTROL0_IC_1_VALUE               0x1

/* ADC_CONTROL1  - Registers (IC 1) */
#define REG_ADC_CONTROL1_IC_1_ADDR                0x1C
#define REG_ADC_CONTROL1_IC_1_BYTE                1
#define REG_ADC_CONTROL1_IC_1_VALUE               0x1

/* ADC_CONTROL2  - Registers (IC 1) */
#define REG_ADC_CONTROL2_IC_1_ADDR                0x1D
#define REG_ADC_CONTROL2_IC_1_BYTE                1
#define REG_ADC_CONTROL2_IC_1_VALUE               0x3

/* ADC_CONTROL3  - Registers (IC 1) */
#define REG_ADC_CONTROL3_IC_1_ADDR                0x1E
#define REG_ADC_CONTROL3_IC_1_BYTE                1
#define REG_ADC_CONTROL3_IC_1_VALUE               0x3

/* ADC0_VOLUME  - Registers (IC 1) */
#define REG_ADC0_VOLUME_IC_1_ADDR                 0x1F
#define REG_ADC0_VOLUME_IC_1_BYTE                 1
#define REG_ADC0_VOLUME_IC_1_VALUE                0x0

/* ADC1_VOLUME  - Registers (IC 1) */
#define REG_ADC1_VOLUME_IC_1_ADDR                 0x20
#define REG_ADC1_VOLUME_IC_1_BYTE                 1
#define REG_ADC1_VOLUME_IC_1_VALUE                0x0

/* ADC2_VOLUME  - Registers (IC 1) */
#define REG_ADC2_VOLUME_IC_1_ADDR                 0x21
#define REG_ADC2_VOLUME_IC_1_BYTE                 1
#define REG_ADC2_VOLUME_IC_1_VALUE                0x0

/* ADC3_VOLUME  - Registers (IC 1) */
#define REG_ADC3_VOLUME_IC_1_ADDR                 0x22
#define REG_ADC3_VOLUME_IC_1_BYTE                 1
#define REG_ADC3_VOLUME_IC_1_VALUE                0x0

/* PGA_CONTROL_0  - Registers (IC 1) */
#define REG_PGA_CONTROL_0_IC_1_ADDR               0x23
#define REG_PGA_CONTROL_0_IC_1_BYTE               1
#define REG_PGA_CONTROL_0_IC_1_VALUE              0x6B

/* PGA_CONTROL_1  - Registers (IC 1) */
#define REG_PGA_CONTROL_1_IC_1_ADDR               0x24
#define REG_PGA_CONTROL_1_IC_1_BYTE               1
#define REG_PGA_CONTROL_1_IC_1_VALUE              0x6B

/* PGA_CONTROL_2  - Registers (IC 1) */
#define REG_PGA_CONTROL_2_IC_1_ADDR               0x25
#define REG_PGA_CONTROL_2_IC_1_BYTE               1
#define REG_PGA_CONTROL_2_IC_1_VALUE              0x6B

/* PGA_CONTROL_3  - Registers (IC 1) */
#define REG_PGA_CONTROL_3_IC_1_ADDR               0x26
#define REG_PGA_CONTROL_3_IC_1_BYTE               1
#define REG_PGA_CONTROL_3_IC_1_VALUE              0x6B

/* PGA_STEP_CONTROL  - Registers (IC 1) */
#define REG_PGA_STEP_CONTROL_IC_1_ADDR            0x27
#define REG_PGA_STEP_CONTROL_IC_1_BYTE            1
#define REG_PGA_STEP_CONTROL_IC_1_VALUE           0x0

/* PGA_10DB_BOOST  - Registers (IC 1) */
#define REG_PGA_10DB_BOOST_IC_1_ADDR              0x28
#define REG_PGA_10DB_BOOST_IC_1_BYTE              1
#define REG_PGA_10DB_BOOST_IC_1_VALUE             0x0

/* POP_SUPPRESS  - Registers (IC 1) */
#define REG_POP_SUPPRESS_IC_1_ADDR                0x29
#define REG_POP_SUPPRESS_IC_1_BYTE                1
#define REG_POP_SUPPRESS_IC_1_VALUE               0x3F

/* TALKTHRU  - Registers (IC 1) */
#define REG_TALKTHRU_IC_1_ADDR                    0x2A
#define REG_TALKTHRU_IC_1_BYTE                    1
#define REG_TALKTHRU_IC_1_VALUE                   0x0

/* TALKTHRU_GAIN0  - Registers (IC 1) */
#define REG_TALKTHRU_GAIN0_IC_1_ADDR              0x2B
#define REG_TALKTHRU_GAIN0_IC_1_BYTE              1
#define REG_TALKTHRU_GAIN0_IC_1_VALUE             0x0

/* TALKTHRU_GAIN1  - Registers (IC 1) */
#define REG_TALKTHRU_GAIN1_IC_1_ADDR              0x2C
#define REG_TALKTHRU_GAIN1_IC_1_BYTE              1
#define REG_TALKTHRU_GAIN1_IC_1_VALUE             0x0

/* MIC_BIAS  - Registers (IC 1) */
#define REG_MIC_BIAS_IC_1_ADDR                    0x2D
#define REG_MIC_BIAS_IC_1_BYTE                    1
#define REG_MIC_BIAS_IC_1_VALUE                   0x30

/* DAC_CONTROL1  - Registers (IC 1) */
#define REG_DAC_CONTROL1_IC_1_ADDR                0x2E
#define REG_DAC_CONTROL1_IC_1_BYTE                1
#define REG_DAC_CONTROL1_IC_1_VALUE               0x3

/* DAC0_VOLUME  - Registers (IC 1) */
#define REG_DAC0_VOLUME_IC_1_ADDR                 0x2F
#define REG_DAC0_VOLUME_IC_1_BYTE                 1
#define REG_DAC0_VOLUME_IC_1_VALUE                0x0

/* DAC1_VOLUME  - Registers (IC 1) */
#define REG_DAC1_VOLUME_IC_1_ADDR                 0x30
#define REG_DAC1_VOLUME_IC_1_BYTE                 1
#define REG_DAC1_VOLUME_IC_1_VALUE                0x0

/* OP_STAGE_MUTES  - Registers (IC 1) */
#define REG_OP_STAGE_MUTES_IC_1_ADDR              0x31
#define REG_OP_STAGE_MUTES_IC_1_BYTE              1
#define REG_OP_STAGE_MUTES_IC_1_VALUE             0x0

/* SAI_0  - Registers (IC 1) */
#define REG_SAI_0_IC_1_ADDR                       0x32
#define REG_SAI_0_IC_1_BYTE                       1
#define REG_SAI_0_IC_1_VALUE                      0x0

/* SAI_1  - Registers (IC 1) */
#define REG_SAI_1_IC_1_ADDR                       0x33
#define REG_SAI_1_IC_1_BYTE                       1
#define REG_SAI_1_IC_1_VALUE                      0x0

/* SOUT_CONTROL0  - Registers (IC 1) */
#define REG_SOUT_CONTROL0_IC_1_ADDR               0x34
#define REG_SOUT_CONTROL0_IC_1_BYTE               1
#define REG_SOUT_CONTROL0_IC_1_VALUE              0x0

/* SOUT_CONTROL1  - Registers (IC 1) */
#define REG_SOUT_CONTROL1_IC_1_ADDR               0x35
#define REG_SOUT_CONTROL1_IC_1_BYTE               1
#define REG_SOUT_CONTROL1_IC_1_VALUE              0x0

/* PDM_OUT  - Registers (IC 1) */
#define REG_PDM_OUT_IC_1_ADDR                     0x36
#define REG_PDM_OUT_IC_1_BYTE                     1
#define REG_PDM_OUT_IC_1_VALUE                    0x0

/* PDM_PATTERN  - Registers (IC 1) */
#define REG_PDM_PATTERN_IC_1_ADDR                 0x37
#define REG_PDM_PATTERN_IC_1_BYTE                 1
#define REG_PDM_PATTERN_IC_1_VALUE                0x0

/* MODE_MP0  - Registers (IC 1) */
#define REG_MODE_MP0_IC_1_ADDR                    0x38
#define REG_MODE_MP0_IC_1_BYTE                    1
#define REG_MODE_MP0_IC_1_VALUE                   0x0

/* MODE_MP1  - Registers (IC 1) */
#define REG_MODE_MP1_IC_1_ADDR                    0x39
#define REG_MODE_MP1_IC_1_BYTE                    1
#define REG_MODE_MP1_IC_1_VALUE                   0x0

/* MODE_MP2  - Registers (IC 1) */
#define REG_MODE_MP2_IC_1_ADDR                    0x3A
#define REG_MODE_MP2_IC_1_BYTE                    1
#define REG_MODE_MP2_IC_1_VALUE                   0x0

/* MODE_MP3  - Registers (IC 1) */
#define REG_MODE_MP3_IC_1_ADDR                    0x3B
#define REG_MODE_MP3_IC_1_BYTE                    1
#define REG_MODE_MP3_IC_1_VALUE                   0x0

/* MODE_MP4  - Registers (IC 1) */
#define REG_MODE_MP4_IC_1_ADDR                    0x3C
#define REG_MODE_MP4_IC_1_BYTE                    1
#define REG_MODE_MP4_IC_1_VALUE                   0x0

/* MODE_MP5  - Registers (IC 1) */
#define REG_MODE_MP5_IC_1_ADDR                    0x3D
#define REG_MODE_MP5_IC_1_BYTE                    1
#define REG_MODE_MP5_IC_1_VALUE                   0x0

/* MODE_MP6  - Registers (IC 1) */
#define REG_MODE_MP6_IC_1_ADDR                    0x3E
#define REG_MODE_MP6_IC_1_BYTE                    1
#define REG_MODE_MP6_IC_1_VALUE                   0x0

