lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* PB_VOL_SET  - Registers (IC 1) */
#define REG_PB_VOL_SET_IC_1_ADDR                  0x3F
#define REG_PB_VOL_SET_IC_1_BYTE                  1
#define REG_PB_VOL_SET_IC_1_VALUE                 0x0

/* PB_VOL_CONV  - Registers (IC 1) */
#define REG_PB_VOL_CONV_IC_1_ADDR                 0x40
#define REG_PB_VOL_CONV_IC_1_BYTE                 1
#define REG_PB_VOL_CONV_IC_1_VALUE                0x87

/* DEBOUNCE_MODE  - Registers (IC 1) */
#define REG_DEBOUNCE_MODE_IC_1_ADDR               0x41
#define REG_DEBOUNCE_MODE_IC_1_BYTE               1
#define REG_DEBOUNCE_MODE_IC_1_VALUE              0x5

/* RESERVED  - Registers (IC 1) */
#define REG_RESERVED_IC_1_ADDR                    0x42
#define REG_RESERVED_IC_1_BYTE                    1
#define REG_RESERVED_IC_1_VALUE                   0x0

/* OP_STAGE_CTRL  - Registers (IC 1) */
#define REG_OP_STAGE_CTRL_IC_1_ADDR               0x43
#define REG_OP_STAGE_CTRL_IC_1_BYTE               1
#define REG_OP_STAGE_CTRL_IC_1_VALUE              0x30

/* DECIM_PWR_MODES  - Registers (IC 1) */
#define REG_DECIM_PWR_MODES_IC_1_ADDR             0x44
#define REG_DECIM_PWR_MODES_IC_1_BYTE             1
#define REG_DECIM_PWR_MODES_IC_1_VALUE            0xF

/* INTERP_PWR_MODES  - Registers (IC 1) */
#define REG_INTERP_PWR_MODES_IC_1_ADDR            0x45
#define REG_INTERP_PWR_MODES_IC_1_BYTE            1
#define REG_INTERP_PWR_MODES_IC_1_VALUE           0xC

/* BIAS_CONTROL0  - Registers (IC 1) */
#define REG_BIAS_CONTROL0_IC_1_ADDR               0x46
#define REG_BIAS_CONTROL0_IC_1_BYTE               1
#define REG_BIAS_CONTROL0_IC_1_VALUE              0x0

/* BIAS_CONTROL1  - Registers (IC 1) */
#define REG_BIAS_CONTROL1_IC_1_ADDR               0x47
#define REG_BIAS_CONTROL1_IC_1_BYTE               1
#define REG_BIAS_CONTROL1_IC_1_VALUE              0x0

/* PAD_CONTROL0  - Registers (IC 1) */
#define REG_PAD_CONTROL0_IC_1_ADDR                0x48
#define REG_PAD_CONTROL0_IC_1_BYTE                1
#define REG_PAD_CONTROL0_IC_1_VALUE               0x7F

/* PAD_CONTROL1  - Registers (IC 1) */
#define REG_PAD_CONTROL1_IC_1_ADDR                0x49
#define REG_PAD_CONTROL1_IC_1_BYTE                1
#define REG_PAD_CONTROL1_IC_1_VALUE               0x13

/* PAD_CONTROL2  - Registers (IC 1) */
#define REG_PAD_CONTROL2_IC_1_ADDR                0x4A
#define REG_PAD_CONTROL2_IC_1_BYTE                1
#define REG_PAD_CONTROL2_IC_1_VALUE               0x0

/* PAD_CONTROL3  - Registers (IC 1) */
#define REG_PAD_CONTROL3_IC_1_ADDR                0x4B
#define REG_PAD_CONTROL3_IC_1_BYTE                1
#define REG_PAD_CONTROL3_IC_1_VALUE               0x0

/* PAD_CONTROL4  - Registers (IC 1) */
#define REG_PAD_CONTROL4_IC_1_ADDR                0x4C
#define REG_PAD_CONTROL4_IC_1_BYTE                1
#define REG_PAD_CONTROL4_IC_1_VALUE               0x0

/* PAD_CONTROL5  - Registers (IC 1) */
#define REG_PAD_CONTROL5_IC_1_ADDR                0x4D
#define REG_PAD_CONTROL5_IC_1_BYTE                1
#define REG_PAD_CONTROL5_IC_1_VALUE               0x0

/* ADC OPER  - Registers (IC 1) */
#define REG_ADC_OPER_IC_1_ADDR                    0x60
#define REG_ADC_OPER_IC_1_BYTE                    1
#define REG_ADC_OPER_IC_1_VALUE                   0xA0


/*
 *
 * Control register's field descriptions
 *
 */

/* CLK_CONTROL (IC 1) */
#define R0_COREN_IC_1                             0x1    /* 1b	[0] */
#define R0_CC_MDIV_IC_1                           0x1    /* 1b	[1] */
#define R0_CC_CDIV_IC_1                           0x1    /* 1b	[2] */
#define R0_CLKSRC_IC_1                            0x0    /* 0b	[3] */
#define R0_XTAL_DIS_IC_1                          0x0    /* 0b	[4] */
#define R0_SPK_FLT_DIS_IC_1                       0x0    /* 0b	[5] */
#define R0_PLL_EN_IC_1                            0x0    /* 0b	[7] */
#define R0_COREN_IC_1_MASK                        0x1
#define R0_COREN_IC_1_SHIFT                       0
#define R0_CC_MDIV_IC_1_MASK                      0x2
#define R0_CC_MDIV_IC_1_SHIFT                     1
#define R0_CC_CDIV_IC_1_MASK                      0x4
#define R0_CC_CDIV_IC_1_SHIFT                     2
#define R0_CLKSRC_IC_1_MASK                       0x8
#define R0_CLKSRC_IC_1_SHIFT                      3
#define R0_XTAL_DIS_IC_1_MASK                     0x10
#define R0_XTAL_DIS_IC_1_SHIFT                    4
#define R0_SPK_FLT_DIS_IC_1_MASK                  0x20
#define R0_SPK_FLT_DIS_IC_1_SHIFT                 5
#define R0_PLL_EN_IC_1_MASK                       0x80
#define R0_PLL_EN_IC_1_SHIFT                      7

/* PLL_CTRL0 (IC 1) */
#define R1_M_MSB_IC_1                             0x00   /* 00000000b	[7:0] */
#define R1_M_MSB_IC_1_MASK                        0xFF
#define R1_M_MSB_IC_1_SHIFT                       0

/* PLL_CTRL1 (IC 1) */
#define R2_M_LSB_IC_1                             0x00   /* 00000000b	[7:0] */
#define R2_M_LSB_IC_1_MASK                        0xFF
#define R2_M_LSB_IC_1_SHIFT                       0

/* PLL_CTRL2 (IC 1) */
#define R3_N_MSB_IC_1                             0x00   /* 00000000b	[7:0] */
#define R3_N_MSB_IC_1_MASK                        0xFF
#define R3_N_MSB_IC_1_SHIFT                       0

/* PLL_CTRL3 (IC 1) */
#define R4_N_LSB_IC_1                             0x00   /* 00000000b	[7:0] */
#define R4_N_LSB_IC_1_MASK                        0xFF
#define R4_N_LSB_IC_1_SHIFT                       0

/* PLL_CTRL4 (IC 1) */
#define R5_PLL_TYPE_IC_1                          0x0    /* 0b	[0] */
#define R5_X_IC_1                                 0x0    /* 00b	[2:1] */
#define R5_R_IC_1                                 0x4    /* 0100b	[6:3] */
#define R5_PLL_TYPE_IC_1_MASK                     0x1
#define R5_PLL_TYPE_IC_1_SHIFT                    0
#define R5_X_IC_1_MASK                            0x6
#define R5_X_IC_1_SHIFT                           1
#define R5_R_IC_1_MASK                            0x78
#define R5_R_IC_1_SHIFT                           3

/* PLL_CTRL5 (IC 1) */
#define R6_LOCK_IC_1                              0x1    /* 1b	[0] */
#define R6_LOCK_IC_1_MASK                         0x1
#define R6_LOCK_IC_1_SHIFT                        0

