lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* CLKOUT_SEL (IC 1) */
#define R7_CLKOUT_FREQ_IC_1                       0x7    /* 111b	[2:0] */
#define R7_CLKOUT_FREQ_IC_1_MASK                  0x7
#define R7_CLKOUT_FREQ_IC_1_SHIFT                 0

/* REGULATOR (IC 1) */
#define R8_REGV_IC_1                              0x1    /* 01b	[1:0] */
#define R8_REG_PD_IC_1                            0x0    /* 0b	[2] */
#define R8_REGV_IC_1_MASK                         0x3
#define R8_REGV_IC_1_SHIFT                        0
#define R8_REG_PD_IC_1_MASK                       0x4
#define R8_REG_PD_IC_1_SHIFT                      2

/* CORE_CONTROL (IC 1) */
#define R9_CORE_RUN_IC_1                          0x1    /* 1b	[0] */
#define R9_CORE_FS_IC_1                           0x1    /* 01b	[2:1] */
#define R9_FAST_SLOW_RATE_IC_1                    0x0    /* 00b	[4:3] */
#define R9_BANK_SL_IC_1                           0x0    /* 0b	[5] */
#define R9_ZERO_STATE_IC_1                        0x0    /* 0b	[7] */
#define R9_CORE_RUN_IC_1_MASK                     0x1
#define R9_CORE_RUN_IC_1_SHIFT                    0
#define R9_CORE_FS_IC_1_MASK                      0x6
#define R9_CORE_FS_IC_1_SHIFT                     1
#define R9_FAST_SLOW_RATE_IC_1_MASK               0x18
#define R9_FAST_SLOW_RATE_IC_1_SHIFT              3
#define R9_BANK_SL_IC_1_MASK                      0x20
#define R9_BANK_SL_IC_1_SHIFT                     5
#define R9_ZERO_STATE_IC_1_MASK                   0x80
#define R9_ZERO_STATE_IC_1_SHIFT                  7

/* SLEEP_INST (IC 1) */
#define R10_SLEEP_IC_1                            0x0    /* 00000b	[4:0] */
#define R10_SLEEP_IC_1_MASK                       0x1F
#define R10_SLEEP_IC_1_SHIFT                      0

/* CORE_ENABLE (IC 1) */
#define R11_DSP_CLK_EN_IC_1                       0x1    /* 1b	[0] */
#define R11_LIM_EN_IC_1                           0x1    /* 1b	[1] */
#define R11_DSP_CLK_EN_IC_1_MASK                  0x1
#define R11_DSP_CLK_EN_IC_1_SHIFT                 0
#define R11_LIM_EN_IC_1_MASK                      0x2
#define R11_LIM_EN_IC_1_SHIFT                     1

/* DBREG0 (IC 1) */
#define R12_ABSVAL0_IC_1                          0x00   /* 00000000b	[7:0] */
#define R12_ABSVAL0_IC_1_MASK                     0xFF
#define R12_ABSVAL0_IC_1_SHIFT                    0

/* DBREG1 (IC 1) */
#define R13_ABSVAL1_IC_1                          0x00   /* 00000000b	[7:0] */
#define R13_ABSVAL1_IC_1_MASK                     0xFF
#define R13_ABSVAL1_IC_1_SHIFT                    0

/* DBREG2 (IC 1) */
#define R14_ABSVAL2_IC_1                          0x00   /* 00000000b	[7:0] */
#define R14_ABSVAL2_IC_1_MASK                     0xFF
#define R14_ABSVAL2_IC_1_SHIFT                    0

/* CORE_IN_MUX_0_1 (IC 1) */
#define R15_CORE_IN_MUX_SEL_0_IC_1                0x0    /* 0000b	[3:0] */
#define R15_CORE_IN_MUX_SEL_1_IC_1                0x1    /* 0001b	[7:4] */
#define R15_CORE_IN_MUX_SEL_0_IC_1_MASK           0xF
#define R15_CORE_IN_MUX_SEL_0_IC_1_SHIFT          0
#define R15_CORE_IN_MUX_SEL_1_IC_1_MASK           0xF0
#define R15_CORE_IN_MUX_SEL_1_IC_1_SHIFT          4

/* CORE_IN_MUX_2_3 (IC 1) */
#define R16_CORE_IN_MUX_SEL_2_IC_1                0x2    /* 0010b	[3:0] */
#define R16_CORE_IN_MUX_SEL_3_IC_1                0x3    /* 0011b	[7:4] */
#define R16_CORE_IN_MUX_SEL_2_IC_1_MASK           0xF
#define R16_CORE_IN_MUX_SEL_2_IC_1_SHIFT          0
#define R16_CORE_IN_MUX_SEL_3_IC_1_MASK           0xF0
#define R16_CORE_IN_MUX_SEL_3_IC_1_SHIFT          4

/* DAC_SOURCE_0_1 (IC 1) */
#define R17_DAC_SOURCE0_IC_1                      0x0    /* 0000b	[3:0] */
#define R17_DAC_SOURCE1_IC_1                      0x1    /* 0001b	[7:4] */
#define R17_DAC_SOURCE0_IC_1_MASK                 0xF
#define R17_DAC_SOURCE0_IC_1_SHIFT                0
#define R17_DAC_SOURCE1_IC_1_MASK                 0xF0
#define R17_DAC_SOURCE1_IC_1_SHIFT                4

/* PDM_SOURCE_0_1 (IC 1) */
#define R18_PDM_SOURCE0_IC_1                      0x2    /* 0010b	[3:0] */
#define R18_PDM_SOURCE1_IC_1                      0x3    /* 0011b	[7:4] */
#define R18_PDM_SOURCE0_IC_1_MASK                 0xF
#define R18_PDM_SOURCE0_IC_1_SHIFT                0
#define R18_PDM_SOURCE1_IC_1_MASK                 0xF0
#define R18_PDM_SOURCE1_IC_1_SHIFT                4

/* SOUT_SOURCE_0_1 (IC 1) */
#define R19_SOUT_SOURCE0_IC_1                     0x4    /* 0100b	[3:0] */
#define R19_SOUT_SOURCE1_IC_1                     0x5    /* 0101b	[7:4] */
#define R19_SOUT_SOURCE0_IC_1_MASK                0xF
#define R19_SOUT_SOURCE0_IC_1_SHIFT               0
#define R19_SOUT_SOURCE1_IC_1_MASK                0xF0
#define R19_SOUT_SOURCE1_IC_1_SHIFT               4

/* SOUT_SOURCE_2_3 (IC 1) */
#define R20_SOUT_SOURCE2_IC_1                     0x6    /* 0110b	[3:0] */
#define R20_SOUT_SOURCE3_IC_1                     0x7    /* 0111b	[7:4] */
#define R20_SOUT_SOURCE2_IC_1_MASK                0xF
#define R20_SOUT_SOURCE2_IC_1_SHIFT               0
#define R20_SOUT_SOURCE3_IC_1_MASK                0xF0
#define R20_SOUT_SOURCE3_IC_1_SHIFT               4

/* SOUT_SOURCE_4_5 (IC 1) */
#define R21_SOUT_SOURCE4_IC_1                     0x4    /* 0100b	[3:0] */
#define R21_SOUT_SOURCE5_IC_1                     0x5    /* 0101b	[7:4] */
#define R21_SOUT_SOURCE4_IC_1_MASK                0xF
#define R21_SOUT_SOURCE4_IC_1_SHIFT               0
#define R21_SOUT_SOURCE5_IC_1_MASK                0xF0
#define R21_SOUT_SOURCE5_IC_1_SHIFT               4

/* SOUT_SOURCE_6_7 (IC 1) */
#define R22_SOUT_SOURCE6_IC_1                     0x6    /* 0110b	[3:0] */
#define R22_SOUT_SOURCE7_IC_1                     0x7    /* 0111b	[7:4] */
#define R22_SOUT_SOURCE6_IC_1_MASK                0xF
#define R22_SOUT_SOURCE6_IC_1_SHIFT               0
#define R22_SOUT_SOURCE7_IC_1_MASK                0xF0
#define R22_SOUT_SOURCE7_IC_1_SHIFT               4

/* ADC_SDATA_CH (IC 1) */
#define R23_ADC_SDATA0_ST_IC_1                    0x0    /* 00b	[1:0] */
#define R23_ADC_SDATA1_ST_IC_1                    0x1    /* 01b	[3:2] */
#define R23_ADC_SDATA0_ST_IC_1_MASK               0x3
#define R23_ADC_SDATA0_ST_IC_1_SHIFT              0
#define R23_ADC_SDATA1_ST_IC_1_MASK               0xC
#define R23_ADC_SDATA1_ST_IC_1_SHIFT              2

/* ASRCO_SOURCE_0_1 (IC 1) */
#define R24_ASRC_OUT_SOURCE0_IC_1                 0x0    /* 0000b	[3:0] */
#define R24_ASRC_OUT_SOURCE1_IC_1                 0x1    /* 0001b	[7:4] */
#define R24_ASRC_OUT_SOURCE0_IC_1_MASK            0xF
#define R24_ASRC_OUT_SOURCE0_IC_1_SHIFT           0
#define R24_ASRC_OUT_SOURCE1_IC_1_MASK            0xF0
#define R24_ASRC_OUT_SOURCE1_IC_1_SHIFT           4

/* ASRCO_SOURCE_2_3 (IC 1) */
#define R25_ASRC_OUT_SOURCE2_IC_1                 0x2    /* 0010b	[3:0] */
#define R25_ASRC_OUT_SOURCE3_IC_1                 0x3    /* 0011b	[7:4] */
#define R25_ASRC_OUT_SOURCE2_IC_1_MASK            0xF
#define R25_ASRC_OUT_SOURCE2_IC_1_SHIFT           0
#define R25_ASRC_OUT_SOURCE3_IC_1_MASK            0xF0
#define R25_ASRC_OUT_SOURCE3_IC_1_SHIFT           4

/* ASRC_MODE (IC 1) */
#define R26_ASRC_IN_EN_IC_1                       0x0    /* 0b	[0] */
#define R26_ASRC_OUT_EN_IC_1                      0x0    /* 0b	[1] */
#define R26_ASRC_IN_CH_IC_1                       0x0    /* 00b	[3:2] */
#define R26_ASRC_IN_EN_IC_1_MASK                  0x1
#define R26_ASRC_IN_EN_IC_1_SHIFT                 0
#define R26_ASRC_OUT_EN_IC_1_MASK                 0x2
#define R26_ASRC_OUT_EN_IC_1_SHIFT                1
#define R26_ASRC_IN_CH_IC_1_MASK                  0xC
#define R26_ASRC_IN_CH_IC_1_SHIFT                 2

/* ADC_CONTROL0 (IC 1) */
#define R27_ADC_0_1_FS_IC_1                       0x1    /* 01b	[1:0] */
#define R27_ADC0_MUTE_IC_1                        0x0    /* 0b	[3] */
#define R27_ADC1_MUTE_IC_1                        0x0    /* 0b	[4] */
#define R27_ADC_0_1_SINC_IC_1                     0x0    /* 0b	[5] */
#define R27_ADC_0_1_FS_IC_1_MASK                  0x3
#define R27_ADC_0_1_FS_IC_1_SHIFT                 0
#define R27_ADC0_MUTE_IC_1_MASK                   0x8
#define R27_ADC0_MUTE_IC_1_SHIFT                  3
#define R27_ADC1_MUTE_IC_1_MASK                   0x10
#define R27_ADC1_MUTE_IC_1_SHIFT                  4
#define R27_ADC_0_1_SINC_IC_1_MASK                0x20
#define R27_ADC_0_1_SINC_IC_1_SHIFT               5

/* ADC_CONTROL1 (IC 1) */
#define R28_ADC_2_3_FS_IC_1                       0x1    /* 01b	[1:0] */
#define R28_ADC2_MUTE_IC_1                        0x0    /* 0b	[3] */
#define R28_ADC3_MUTE_IC_1                        0x0    /* 0b	[4] */
#define R28_ADC_2_3_SINC_IC_1                     0x0    /* 0b	[5] */
#define R28_ADC_2_3_FS_IC_1_MASK                  0x3
#define R28_ADC_2_3_FS_IC_1_SHIFT                 0
#define R28_ADC2_MUTE_IC_1_MASK                   0x8
#define R28_ADC2_MUTE_IC_1_SHIFT                  3
#define R28_ADC3_MUTE_IC_1_MASK                   0x10
#define R28_ADC3_MUTE_IC_1_SHIFT                  4
#define R28_ADC_2_3_SINC_IC_1_MASK                0x20
#define R28_ADC_2_3_SINC_IC_1_SHIFT               5

/* ADC_CONTROL2 (IC 1) */
#define R29_ADC_0_EN_IC_1                         0x1    /* 1b	[0] */
#define R29_ADC_1_EN_IC_1                         0x1    /* 1b	[1] */
#define R29_DCM_0_1_IC_1                          0x0    /* 0b	[2] */
#define R29_DMIC_SW0_IC_1                         0x0    /* 0b	[3] */
#define R29_DMIC_POL0_IC_1                        0x0    /* 0b	[4] */
#define R29_HP_0_1_EN_IC_1                        0x0    /* 00b	[6:5] */
#define R29_ADC_0_EN_IC_1_MASK                    0x1
#define R29_ADC_0_EN_IC_1_SHIFT                   0
#define R29_ADC_1_EN_IC_1_MASK                    0x2
#define R29_ADC_1_EN_IC_1_SHIFT                   1
#define R29_DCM_0_1_IC_1_MASK                     0x4
#define R29_DCM_0_1_IC_1_SHIFT                    2
#define R29_DMIC_SW0_IC_1_MASK                    0x8
#define R29_DMIC_SW0_IC_1_SHIFT                   3
#define R29_DMIC_POL0_IC_1_MASK                   0x10
#define R29_DMIC_POL0_IC_1_SHIFT                  4
#define R29_HP_0_1_EN_IC_1_MASK                   0x60
#define R29_HP_0_1_EN_IC_1_SHIFT                  5

/* ADC_CONTROL3 (IC 1) */
#define R30_ADC_2_EN_IC_1                         0x1    /* 1b	[0] */
#define R30_ADC_3_EN_IC_1                         0x1    /* 1b	[1] */
#define R30_DCM_2_3_IC_1                          0x0    /* 0b	[2] */
#define R30_DMIC_SW1_IC_1                         0x0    /* 0b	[3] */
#define R30_DMIC_POL1_IC_1                        0x0    /* 0b	[4] */
#define R30_HP_2_3_EN_IC_1                        0x0    /* 00b	[6:5] */
#define R30_ADC_2_EN_IC_1_MASK                    0x1
#define R30_ADC_2_EN_IC_1_SHIFT                   0
#define R30_ADC_3_EN_IC_1_MASK                    0x2
#define R30_ADC_3_EN_IC_1_SHIFT                   1
#define R30_DCM_2_3_IC_1_MASK                     0x4
#define R30_DCM_2_3_IC_1_SHIFT                    2
#define R30_DMIC_SW1_IC_1_MASK                    0x8
#define R30_DMIC_SW1_IC_1_SHIFT                   3
#define R30_DMIC_POL1_IC_1_MASK                   0x10
#define R30_DMIC_POL1_IC_1_SHIFT                  4
#define R30_HP_2_3_EN_IC_1_MASK                   0x60
#define R30_HP_2_3_EN_IC_1_SHIFT                  5

/* ADC0_VOLUME (IC 1) */
#define R31_ADC_0_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R31_ADC_0_VOL_IC_1_MASK                   0xFF
#define R31_ADC_0_VOL_IC_1_SHIFT                  0

/* ADC1_VOLUME (IC 1) */
#define R32_ADC_1_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R32_ADC_1_VOL_IC_1_MASK                   0xFF
#define R32_ADC_1_VOL_IC_1_SHIFT                  0

