lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* ADC2_VOLUME (IC 1) */
#define R33_ADC_2_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R33_ADC_2_VOL_IC_1_MASK                   0xFF
#define R33_ADC_2_VOL_IC_1_SHIFT                  0

/* ADC3_VOLUME (IC 1) */
#define R34_ADC_3_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R34_ADC_3_VOL_IC_1_MASK                   0xFF
#define R34_ADC_3_VOL_IC_1_SHIFT                  0

/* PGA_CONTROL_0 (IC 1) */
#define R35_PGA_GAIN0_IC_1                        0x2B   /* 101011b	[5:0] */
#define R35_PGA_MUTE0_IC_1                        0x1    /* 1b	[6] */
#define R35_PGA_EN0_IC_1                          0x0    /* 0b	[7] */
#define R35_PGA_GAIN0_IC_1_MASK                   0x3F
#define R35_PGA_GAIN0_IC_1_SHIFT                  0
#define R35_PGA_MUTE0_IC_1_MASK                   0x40
#define R35_PGA_MUTE0_IC_1_SHIFT                  6
#define R35_PGA_EN0_IC_1_MASK                     0x80
#define R35_PGA_EN0_IC_1_SHIFT                    7

/* PGA_CONTROL_1 (IC 1) */
#define R36_PGA_GAIN1_IC_1                        0x2B   /* 101011b	[5:0] */
#define R36_PGA_MUTE1_IC_1                        0x1    /* 1b	[6] */
#define R36_PGA_EN1_IC_1                          0x0    /* 0b	[7] */
#define R36_PGA_GAIN1_IC_1_MASK                   0x3F
#define R36_PGA_GAIN1_IC_1_SHIFT                  0
#define R36_PGA_MUTE1_IC_1_MASK                   0x40
#define R36_PGA_MUTE1_IC_1_SHIFT                  6
#define R36_PGA_EN1_IC_1_MASK                     0x80
#define R36_PGA_EN1_IC_1_SHIFT                    7

/* PGA_CONTROL_2 (IC 1) */
#define R37_PGA_GAIN2_IC_1                        0x2B   /* 101011b	[5:0] */
#define R37_PGA_MUTE2_IC_1                        0x1    /* 1b	[6] */
#define R37_PGA_EN2_IC_1                          0x0    /* 0b	[7] */
#define R37_PGA_GAIN2_IC_1_MASK                   0x3F
#define R37_PGA_GAIN2_IC_1_SHIFT                  0
#define R37_PGA_MUTE2_IC_1_MASK                   0x40
#define R37_PGA_MUTE2_IC_1_SHIFT                  6
#define R37_PGA_EN2_IC_1_MASK                     0x80
#define R37_PGA_EN2_IC_1_SHIFT                    7

/* PGA_CONTROL_3 (IC 1) */
#define R38_PGA_GAIN3_IC_1                        0x2B   /* 101011b	[5:0] */
#define R38_PGA_MUTE3_IC_1                        0x1    /* 1b	[6] */
#define R38_PGA_EN3_IC_1                          0x0    /* 0b	[7] */
#define R38_PGA_GAIN3_IC_1_MASK                   0x3F
#define R38_PGA_GAIN3_IC_1_SHIFT                  0
#define R38_PGA_MUTE3_IC_1_MASK                   0x40
#define R38_PGA_MUTE3_IC_1_SHIFT                  6
#define R38_PGA_EN3_IC_1_MASK                     0x80
#define R38_PGA_EN3_IC_1_SHIFT                    7

/* PGA_STEP_CONTROL (IC 1) */
#define R39_SLEW_PD0_IC_1                         0x0    /* 0b	[0] */
#define R39_SLEW_PD1_IC_1                         0x0    /* 0b	[1] */
#define R39_SLEW_PD2_IC_1                         0x0    /* 0b	[2] */
#define R39_SLEW_PD3_IC_1                         0x0    /* 0b	[3] */
#define R39_SLEW_RATE_IC_1                        0x0    /* 00b	[5:4] */
#define R39_SLEW_PD0_IC_1_MASK                    0x1
#define R39_SLEW_PD0_IC_1_SHIFT                   0
#define R39_SLEW_PD1_IC_1_MASK                    0x2
#define R39_SLEW_PD1_IC_1_SHIFT                   1
#define R39_SLEW_PD2_IC_1_MASK                    0x4
#define R39_SLEW_PD2_IC_1_SHIFT                   2
#define R39_SLEW_PD3_IC_1_MASK                    0x8
#define R39_SLEW_PD3_IC_1_SHIFT                   3
#define R39_SLEW_RATE_IC_1_MASK                   0x30
#define R39_SLEW_RATE_IC_1_SHIFT                  4

/* PGA_10DB_BOOST (IC 1) */
#define R40_PGA_0_BOOST_IC_1                      0x0    /* 0b	[0] */
#define R40_PGA_1_BOOST_IC_1                      0x0    /* 0b	[1] */
#define R40_PGA_2_BOOST_IC_1                      0x0    /* 0b	[2] */
#define R40_PGA_3_BOOST_IC_1                      0x0    /* 0b	[3] */
#define R40_PGA_0_BOOST_IC_1_MASK                 0x1
#define R40_PGA_0_BOOST_IC_1_SHIFT                0
#define R40_PGA_1_BOOST_IC_1_MASK                 0x2
#define R40_PGA_1_BOOST_IC_1_SHIFT                1
#define R40_PGA_2_BOOST_IC_1_MASK                 0x4
#define R40_PGA_2_BOOST_IC_1_SHIFT                2
#define R40_PGA_3_BOOST_IC_1_MASK                 0x8
#define R40_PGA_3_BOOST_IC_1_SHIFT                3

/* POP_SUPPRESS (IC 1) */
#define R41_PGA_POP_DIS0_IC_1                     0x1    /* 1b	[0] */
#define R41_PGA_POP_DIS1_IC_1                     0x1    /* 1b	[1] */
#define R41_PGA_POP_DIS2_IC_1                     0x1    /* 1b	[2] */
#define R41_PGA_POP_DIS3_IC_1                     0x1    /* 1b	[3] */
#define R41_HP_POP_DIS0_IC_1                      0x1    /* 1b	[4] */
#define R41_HP_POP_DIS1_IC_1                      0x1    /* 1b	[5] */
#define R41_PGA_POP_DIS0_IC_1_MASK                0x1
#define R41_PGA_POP_DIS0_IC_1_SHIFT               0
#define R41_PGA_POP_DIS1_IC_1_MASK                0x2
#define R41_PGA_POP_DIS1_IC_1_SHIFT               1
#define R41_PGA_POP_DIS2_IC_1_MASK                0x4
#define R41_PGA_POP_DIS2_IC_1_SHIFT               2
#define R41_PGA_POP_DIS3_IC_1_MASK                0x8
#define R41_PGA_POP_DIS3_IC_1_SHIFT               3
#define R41_HP_POP_DIS0_IC_1_MASK                 0x10
#define R41_HP_POP_DIS0_IC_1_SHIFT                4
#define R41_HP_POP_DIS1_IC_1_MASK                 0x20
#define R41_HP_POP_DIS1_IC_1_SHIFT                5

/* TALKTHRU (IC 1) */
#define R42_TALKTHRU_PATH_IC_1                    0x0    /* 00b	[1:0] */
#define R42_TALKTHRU_PATH_IC_1_MASK               0x3
#define R42_TALKTHRU_PATH_IC_1_SHIFT              0

/* TALKTHRU_GAIN0 (IC 1) */
#define R43_TALKTHRU_GAIN0_VAL_IC_1               0x00   /* 00000000b	[7:0] */
#define R43_TALKTHRU_GAIN0_VAL_IC_1_MASK          0xFF
#define R43_TALKTHRU_GAIN0_VAL_IC_1_SHIFT         0

/* TALKTHRU_GAIN1 (IC 1) */
#define R44_TALKTHRU_GAIN1_VAL_IC_1               0x00   /* 00000000b	[7:0] */
#define R44_TALKTHRU_GAIN1_VAL_IC_1_MASK          0xFF
#define R44_TALKTHRU_GAIN1_VAL_IC_1_SHIFT         0

