lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* MIC_BIAS (IC 1) */
#define R45_MIC_GAIN0_IC_1                        0x0    /* 0b	[0] */
#define R45_MIC_GAIN1_IC_1                        0x0    /* 0b	[1] */
#define R45_MIC_HI_PERF0_IC_1                     0x0    /* 0b	[2] */
#define R45_MIC_HI_PERF1_IC_1                     0x0    /* 0b	[3] */
#define R45_MIC_EN0_IC_1                          0x1    /* 1b	[4] */
#define R45_MIC_EN1_IC_1                          0x1    /* 1b	[5] */
#define R45_MIC_GAIN0_IC_1_MASK                   0x1
#define R45_MIC_GAIN0_IC_1_SHIFT                  0
#define R45_MIC_GAIN1_IC_1_MASK                   0x2
#define R45_MIC_GAIN1_IC_1_SHIFT                  1
#define R45_MIC_HI_PERF0_IC_1_MASK                0x4
#define R45_MIC_HI_PERF0_IC_1_SHIFT               2
#define R45_MIC_HI_PERF1_IC_1_MASK                0x8
#define R45_MIC_HI_PERF1_IC_1_SHIFT               3
#define R45_MIC_EN0_IC_1_MASK                     0x10
#define R45_MIC_EN0_IC_1_SHIFT                    4
#define R45_MIC_EN1_IC_1_MASK                     0x20
#define R45_MIC_EN1_IC_1_SHIFT                    5

/* DAC_CONTROL1 (IC 1) */
#define R46_DAC0_EN_IC_1                          0x1    /* 1b	[0] */
#define R46_DAC1_EN_IC_1                          0x1    /* 1b	[1] */
#define R46_DAC0_MUTE_IC_1                        0x0    /* 0b	[3] */
#define R46_DAC1_MUTE_IC_1                        0x0    /* 0b	[4] */
#define R46_DAC_POL_IC_1                          0x0    /* 0b	[5] */
#define R46_DAC0_EN_IC_1_MASK                     0x1
#define R46_DAC0_EN_IC_1_SHIFT                    0
#define R46_DAC1_EN_IC_1_MASK                     0x2
#define R46_DAC1_EN_IC_1_SHIFT                    1
#define R46_DAC0_MUTE_IC_1_MASK                   0x8
#define R46_DAC0_MUTE_IC_1_SHIFT                  3
#define R46_DAC1_MUTE_IC_1_MASK                   0x10
#define R46_DAC1_MUTE_IC_1_SHIFT                  4
#define R46_DAC_POL_IC_1_MASK                     0x20
#define R46_DAC_POL_IC_1_SHIFT                    5

/* DAC0_VOLUME (IC 1) */
#define R47_DAC_0_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R47_DAC_0_VOL_IC_1_MASK                   0xFF
#define R47_DAC_0_VOL_IC_1_SHIFT                  0

/* DAC1_VOLUME (IC 1) */
#define R48_DAC_1_VOL_IC_1                        0x00   /* 00000000b	[7:0] */
#define R48_DAC_1_VOL_IC_1_MASK                   0xFF
#define R48_DAC_1_VOL_IC_1_SHIFT                  0

/* OP_STAGE_MUTES (IC 1) */
#define R49_HP_MUTE_L_IC_1                        0x0    /* 00b	[1:0] */
#define R49_HP_MUTE_R_IC_1                        0x0    /* 00b	[3:2] */
#define R49_HP_MUTE_L_IC_1_MASK                   0x3
#define R49_HP_MUTE_L_IC_1_SHIFT                  0
#define R49_HP_MUTE_R_IC_1_MASK                   0xC
#define R49_HP_MUTE_R_IC_1_SHIFT                  2

/* SAI_0 (IC 1) */
#define R50_SER_PORT_FS_IC_1                      0x0    /* 0000b	[3:0] */
#define R50_SAI_IC_1                              0x0    /* 00b	[5:4] */
#define R50_SDATA_FMT_IC_1                        0x0    /* 00b	[7:6] */
#define R50_SER_PORT_FS_IC_1_MASK                 0xF
#define R50_SER_PORT_FS_IC_1_SHIFT                0
#define R50_SAI_IC_1_MASK                         0x30
#define R50_SAI_IC_1_SHIFT                        4
#define R50_SDATA_FMT_IC_1_MASK                   0xC0
#define R50_SDATA_FMT_IC_1_SHIFT                  6

/* SAI_1 (IC 1) */
#define R51_SAI_MS_IC_1                           0x0    /* 0b	[0] */
#define R51_BCLKEDGE_IC_1                         0x0    /* 0b	[1] */
#define R51_BCLKRATE_IC_1                         0x0    /* 0b	[2] */
#define R51_SAI_MSB_IC_1                          0x0    /* 0b	[3] */
#define R51_LR_POL_IC_1                           0x0    /* 0b	[4] */
#define R51_LR_MODE_IC_1                          0x0    /* 0b	[5] */
#define R51_BCLK_TDMC_IC_1                        0x0    /* 0b	[6] */
#define R51_TDM_TS_IC_1                           0x0    /* 0b	[7] */
#define R51_SAI_MS_IC_1_MASK                      0x1
#define R51_SAI_MS_IC_1_SHIFT                     0
#define R51_BCLKEDGE_IC_1_MASK                    0x2
#define R51_BCLKEDGE_IC_1_SHIFT                   1
#define R51_BCLKRATE_IC_1_MASK                    0x4
#define R51_BCLKRATE_IC_1_SHIFT                   2
#define R51_SAI_MSB_IC_1_MASK                     0x8
#define R51_SAI_MSB_IC_1_SHIFT                    3
#define R51_LR_POL_IC_1_MASK                      0x10
#define R51_LR_POL_IC_1_SHIFT                     4
#define R51_LR_MODE_IC_1_MASK                     0x20
#define R51_LR_MODE_IC_1_SHIFT                    5
#define R51_BCLK_TDMC_IC_1_MASK                   0x40
#define R51_BCLK_TDMC_IC_1_SHIFT                  6
#define R51_TDM_TS_IC_1_MASK                      0x80
#define R51_TDM_TS_IC_1_SHIFT                     7

/* SOUT_CONTROL0 (IC 1) */
#define R52_TDM0_DIS_IC_1                         0x0    /* 0b	[0] */
#define R52_TDM1_DIS_IC_1                         0x0    /* 0b	[1] */
#define R52_TDM2_DIS_IC_1                         0x0    /* 0b	[2] */
#define R52_TDM3_DIS_IC_1                         0x0    /* 0b	[3] */
#define R52_TDM4_DIS_IC_1                         0x0    /* 0b	[4] */
#define R52_TDM5_DIS_IC_1                         0x0    /* 0b	[5] */
#define R52_TDM6_DIS_IC_1                         0x0    /* 0b	[6] */
#define R52_TDM7_DIS_IC_1                         0x0    /* 0b	[7] */
#define R52_TDM0_DIS_IC_1_MASK                    0x1
#define R52_TDM0_DIS_IC_1_SHIFT                   0
#define R52_TDM1_DIS_IC_1_MASK                    0x2
#define R52_TDM1_DIS_IC_1_SHIFT                   1
#define R52_TDM2_DIS_IC_1_MASK                    0x4
#define R52_TDM2_DIS_IC_1_SHIFT                   2
#define R52_TDM3_DIS_IC_1_MASK                    0x8
#define R52_TDM3_DIS_IC_1_SHIFT                   3
#define R52_TDM4_DIS_IC_1_MASK                    0x10
#define R52_TDM4_DIS_IC_1_SHIFT                   4
#define R52_TDM5_DIS_IC_1_MASK                    0x20
#define R52_TDM5_DIS_IC_1_SHIFT                   5
#define R52_TDM6_DIS_IC_1_MASK                    0x40
#define R52_TDM6_DIS_IC_1_SHIFT                   6
#define R52_TDM7_DIS_IC_1_MASK                    0x80
#define R52_TDM7_DIS_IC_1_SHIFT                   7

/* PDM_OUT (IC 1) */
#define R53_PDM_EN_IC_1                           0x0    /* 00b	[1:0] */
#define R53_PDM_CH_IC_1                           0x0    /* 00b	[3:2] */
#define R53_PDM_CTRL_IC_1                         0x0    /* 0b	[4] */
#define R53_PDM_EN_IC_1_MASK                      0x3
#define R53_PDM_EN_IC_1_SHIFT                     0
#define R53_PDM_CH_IC_1_MASK                      0xC
#define R53_PDM_CH_IC_1_SHIFT                     2
#define R53_PDM_CTRL_IC_1_MASK                    0x10
#define R53_PDM_CTRL_IC_1_SHIFT                   4

/* PDM_PATTERN (IC 1) */
#define R54_PATTERN_IC_1                          0x00   /* 00000000b	[7:0] */
#define R54_PATTERN_IC_1_MASK                     0xFF
#define R54_PATTERN_IC_1_SHIFT                    0

/* MODE_MP0 (IC 1) */
#define R55_MODE_MP0_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R55_MODE_MP0_VAL_IC_1_MASK                0x1F
#define R55_MODE_MP0_VAL_IC_1_SHIFT               0

/* MODE_MP1 (IC 1) */
#define R56_MODE_MP1_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R56_MODE_MP1_VAL_IC_1_MASK                0x1F
#define R56_MODE_MP1_VAL_IC_1_SHIFT               0

/* MODE_MP2 (IC 1) */
#define R57_MODE_MP2_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R57_MODE_MP2_VAL_IC_1_MASK                0x1F
#define R57_MODE_MP2_VAL_IC_1_SHIFT               0

/* MODE_MP3 (IC 1) */
#define R58_MODE_MP3_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R58_MODE_MP3_VAL_IC_1_MASK                0x1F
#define R58_MODE_MP3_VAL_IC_1_SHIFT               0

/* MODE_MP4 (IC 1) */
#define R59_MODE_MP4_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R59_MODE_MP4_VAL_IC_1_MASK                0x1F
#define R59_MODE_MP4_VAL_IC_1_SHIFT               0

/* MODE_MP5 (IC 1) */
#define R60_MODE_MP5_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R60_MODE_MP5_VAL_IC_1_MASK                0x1F
#define R60_MODE_MP5_VAL_IC_1_SHIFT               0

