lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* MODE_MP6 (IC 1) */
#define R61_MODE_MP6_VAL_IC_1                     0x0    /* 00000b	[4:0] */
#define R61_MODE_MP6_VAL_IC_1_MASK                0x1F
#define R61_MODE_MP6_VAL_IC_1_SHIFT               0

/* PB_VOL_SET (IC 1) */
#define R62_HOLD_IC_1                             0x0    /* 000b	[2:0] */
#define R62_PB_VOL_INIT_VAL_IC_1                  0x0    /* 00000b	[7:3] */
#define R62_HOLD_IC_1_MASK                        0x7
#define R62_HOLD_IC_1_SHIFT                       0
#define R62_PB_VOL_INIT_VAL_IC_1_MASK             0xF8
#define R62_PB_VOL_INIT_VAL_IC_1_SHIFT            3

/* PB_VOL_CONV (IC 1) */
#define R63_PB_VOL_CONV_VAL_IC_1                  0x7    /* 111b	[2:0] */
#define R63_RAMPSPEED_IC_1                        0x0    /* 000b	[5:3] */
#define R63_GAINSTEP_IC_1                         0x2    /* 10b	[7:6] */
#define R63_PB_VOL_CONV_VAL_IC_1_MASK             0x7
#define R63_PB_VOL_CONV_VAL_IC_1_SHIFT            0
#define R63_RAMPSPEED_IC_1_MASK                   0x38
#define R63_RAMPSPEED_IC_1_SHIFT                  3
#define R63_GAINSTEP_IC_1_MASK                    0xC0
#define R63_GAINSTEP_IC_1_SHIFT                   6

/* DEBOUNCE_MODE (IC 1) */
#define R64_DEBOUNCE_IC_1                         0x5    /* 101b	[2:0] */
#define R64_DEBOUNCE_IC_1_MASK                    0x7
#define R64_DEBOUNCE_IC_1_SHIFT                   0

/* OP_STAGE_CTRL (IC 1) */
#define R65_HP_PDN_L_IC_1                         0x0    /* 00b	[1:0] */
#define R65_HP_PDN_R_IC_1                         0x0    /* 00b	[3:2] */
#define R65_HP_EN_L_IC_1                          0x1    /* 1b	[4] */
#define R65_HP_EN_R_IC_1                          0x1    /* 1b	[5] */
#define R65_HP_PDN_L_IC_1_MASK                    0x3
#define R65_HP_PDN_L_IC_1_SHIFT                   0
#define R65_HP_PDN_R_IC_1_MASK                    0xC
#define R65_HP_PDN_R_IC_1_SHIFT                   2
#define R65_HP_EN_L_IC_1_MASK                     0x10
#define R65_HP_EN_L_IC_1_SHIFT                    4
#define R65_HP_EN_R_IC_1_MASK                     0x20
#define R65_HP_EN_R_IC_1_SHIFT                    5

/* DECIM_PWR_MODES (IC 1) */
#define R66_SINC_0_EN_IC_1                        0x1    /* 1b	[0] */
#define R66_SINC_1_EN_IC_1                        0x1    /* 1b	[1] */
#define R66_SINC_2_EN_IC_1                        0x1    /* 1b	[2] */
#define R66_SINC_3_EN_IC_1                        0x1    /* 1b	[3] */
#define R66_DEC_0_EN_IC_1                         0x0    /* 0b	[4] */
#define R66_DEC_1_EN_IC_1                         0x0    /* 0b	[5] */
#define R66_DEC_2_EN_IC_1                         0x0    /* 0b	[6] */
#define R66_DEC_3_EN_IC_1                         0x0    /* 0b	[7] */
#define R66_SINC_0_EN_IC_1_MASK                   0x1
#define R66_SINC_0_EN_IC_1_SHIFT                  0
#define R66_SINC_1_EN_IC_1_MASK                   0x2
#define R66_SINC_1_EN_IC_1_SHIFT                  1
#define R66_SINC_2_EN_IC_1_MASK                   0x4
#define R66_SINC_2_EN_IC_1_SHIFT                  2
#define R66_SINC_3_EN_IC_1_MASK                   0x8
#define R66_SINC_3_EN_IC_1_SHIFT                  3
#define R66_DEC_0_EN_IC_1_MASK                    0x10
#define R66_DEC_0_EN_IC_1_SHIFT                   4
#define R66_DEC_1_EN_IC_1_MASK                    0x20
#define R66_DEC_1_EN_IC_1_SHIFT                   5
#define R66_DEC_2_EN_IC_1_MASK                    0x40
#define R66_DEC_2_EN_IC_1_SHIFT                   6
#define R66_DEC_3_EN_IC_1_MASK                    0x80
#define R66_DEC_3_EN_IC_1_SHIFT                   7

/* INTERP_PWR_MODES (IC 1) */
#define R67_INT_0_EN_IC_1                         0x0    /* 0b	[0] */
#define R67_INT_1_EN_IC_1                         0x0    /* 0b	[1] */
#define R67_MOD_0_EN_IC_1                         0x1    /* 1b	[2] */
#define R67_MOD_1_EN_IC_1                         0x1    /* 1b	[3] */
#define R67_INT_0_EN_IC_1_MASK                    0x1
#define R67_INT_0_EN_IC_1_SHIFT                   0
#define R67_INT_1_EN_IC_1_MASK                    0x2
#define R67_INT_1_EN_IC_1_SHIFT                   1
#define R67_MOD_0_EN_IC_1_MASK                    0x4
#define R67_MOD_0_EN_IC_1_SHIFT                   2
#define R67_MOD_1_EN_IC_1_MASK                    0x8
#define R67_MOD_1_EN_IC_1_SHIFT                   3

/* BIAS_CONTROL0 (IC 1) */
#define R68_ADC_IBIAS01_IC_1                      0x0    /* 00b	[1:0] */
#define R68_ADC_IBIAS23_IC_1                      0x0    /* 00b	[3:2] */
#define R68_AFE_IBIAS01_IC_1                      0x0    /* 00b	[5:4] */
#define R68_HP_IBIAS_IC_1                         0x0    /* 00b	[7:6] */
#define R68_ADC_IBIAS01_IC_1_MASK                 0x3
#define R68_ADC_IBIAS01_IC_1_SHIFT                0
#define R68_ADC_IBIAS23_IC_1_MASK                 0xC
#define R68_ADC_IBIAS23_IC_1_SHIFT                2
#define R68_AFE_IBIAS01_IC_1_MASK                 0x30
#define R68_AFE_IBIAS01_IC_1_SHIFT                4
#define R68_HP_IBIAS_IC_1_MASK                    0xC0
#define R68_HP_IBIAS_IC_1_SHIFT                   6

/* BIAS_CONTROL1 (IC 1) */
#define R69_DAC_IBIAS_IC_1                        0x0    /* 00b	[1:0] */
#define R69_MIC_IBIAS_IC_1                        0x0    /* 00b	[3:2] */
#define R69_AFE_IBIAS23_IC_1                      0x0    /* 00b	[5:4] */
#define R69_CBIAS_DIS_IC_1                        0x0    /* 0b	[6] */
#define R69_DAC_IBIAS_IC_1_MASK                   0x3
#define R69_DAC_IBIAS_IC_1_SHIFT                  0
#define R69_MIC_IBIAS_IC_1_MASK                   0xC
#define R69_MIC_IBIAS_IC_1_SHIFT                  2
#define R69_AFE_IBIAS23_IC_1_MASK                 0x30
#define R69_AFE_IBIAS23_IC_1_SHIFT                4
#define R69_CBIAS_DIS_IC_1_MASK                   0x40
#define R69_CBIAS_DIS_IC_1_SHIFT                  6

/* PAD_CONTROL0 (IC 1) */
#define R70_DAC_SDATA_PU_IC_1                     0x1    /* 1b	[0] */
#define R70_ADC_SDATA0_PU_IC_1                    0x1    /* 1b	[1] */
#define R70_ADC_SDATA1_PU_IC_1                    0x1    /* 1b	[2] */
#define R70_BCLK_PU_IC_1                          0x1    /* 1b	[3] */
#define R70_LRCLK_PU_IC_1                         0x1    /* 1b	[4] */
#define R70_DMIC1_2_PU_IC_1                       0x1    /* 1b	[5] */
#define R70_DMIC3_4_PU_IC_1                       0x1    /* 1b	[6] */
#define R70_DAC_SDATA_PU_IC_1_MASK                0x1
#define R70_DAC_SDATA_PU_IC_1_SHIFT               0
#define R70_ADC_SDATA0_PU_IC_1_MASK               0x2
#define R70_ADC_SDATA0_PU_IC_1_SHIFT              1
#define R70_ADC_SDATA1_PU_IC_1_MASK               0x4
#define R70_ADC_SDATA1_PU_IC_1_SHIFT              2
#define R70_BCLK_PU_IC_1_MASK                     0x8
#define R70_BCLK_PU_IC_1_SHIFT                    3
#define R70_LRCLK_PU_IC_1_MASK                    0x10
#define R70_LRCLK_PU_IC_1_SHIFT                   4
#define R70_DMIC1_2_PU_IC_1_MASK                  0x20
#define R70_DMIC1_2_PU_IC_1_SHIFT                 5
#define R70_DMIC3_4_PU_IC_1_MASK                  0x40
#define R70_DMIC3_4_PU_IC_1_SHIFT                 6

/* PAD_CONTROL1 (IC 1) */
#define R71_ADDR0_PU_IC_1                         0x1    /* 1b	[0] */
#define R71_ADDR1_PU_IC_1                         0x1    /* 1b	[1] */
#define R71_SDA_PU_IC_1                           0x0    /* 0b	[2] */
#define R71_SCL_PU_IC_1                           0x0    /* 0b	[3] */
#define R71_SELFBOOT_PU_IC_1                      0x1    /* 1b	[4] */
#define R71_ADDR0_PU_IC_1_MASK                    0x1
#define R71_ADDR0_PU_IC_1_SHIFT                   0
#define R71_ADDR1_PU_IC_1_MASK                    0x2
#define R71_ADDR1_PU_IC_1_SHIFT                   1
#define R71_SDA_PU_IC_1_MASK                      0x4
#define R71_SDA_PU_IC_1_SHIFT                     2
#define R71_SCL_PU_IC_1_MASK                      0x8
#define R71_SCL_PU_IC_1_SHIFT                     3
#define R71_SELFBOOT_PU_IC_1_MASK                 0x10
#define R71_SELFBOOT_PU_IC_1_SHIFT                4

