lukaso25/tm4c-ssi-multichanel-audio/ADAU1772/sigmaDSP1772_IC_1_REG.h
/* PAD_CONTROL2 (IC 1) */
#define R72_DAC_SDATA_PD_IC_1                     0x0    /* 0b	[0] */
#define R72_ADC_SDATA0_PD_IC_1                    0x0    /* 0b	[1] */
#define R72_ADC_SDATA1_PD_IC_1                    0x0    /* 0b	[2] */
#define R72_BCLK_PD_IC_1                          0x0    /* 0b	[3] */
#define R72_LRCLK_PD_IC_1                         0x0    /* 0b	[4] */
#define R72_DMIC0_1_PD_IC_1                       0x0    /* 0b	[5] */
#define R72_DMIC2_3_PD_IC_1                       0x0    /* 0b	[6] */
#define R72_DAC_SDATA_PD_IC_1_MASK                0x1
#define R72_DAC_SDATA_PD_IC_1_SHIFT               0
#define R72_ADC_SDATA0_PD_IC_1_MASK               0x2
#define R72_ADC_SDATA0_PD_IC_1_SHIFT              1
#define R72_ADC_SDATA1_PD_IC_1_MASK               0x4
#define R72_ADC_SDATA1_PD_IC_1_SHIFT              2
#define R72_BCLK_PD_IC_1_MASK                     0x8
#define R72_BCLK_PD_IC_1_SHIFT                    3
#define R72_LRCLK_PD_IC_1_MASK                    0x10
#define R72_LRCLK_PD_IC_1_SHIFT                   4
#define R72_DMIC0_1_PD_IC_1_MASK                  0x20
#define R72_DMIC0_1_PD_IC_1_SHIFT                 5
#define R72_DMIC2_3_PD_IC_1_MASK                  0x40
#define R72_DMIC2_3_PD_IC_1_SHIFT                 6

/* PAD_CONTROL3 (IC 1) */
#define R73_ADDR0_PD_IC_1                         0x0    /* 0b	[0] */
#define R73_ADDR1_PD_IC_1                         0x0    /* 0b	[1] */
#define R73_SDA_PD_IC_1                           0x0    /* 0b	[2] */
#define R73_SCL_PD_IC_1                           0x0    /* 0b	[3] */
#define R73_SELFBOOT_PD_IC_1                      0x0    /* 0b	[4] */
#define R73_ADDR0_PD_IC_1_MASK                    0x1
#define R73_ADDR0_PD_IC_1_SHIFT                   0
#define R73_ADDR1_PD_IC_1_MASK                    0x2
#define R73_ADDR1_PD_IC_1_SHIFT                   1
#define R73_SDA_PD_IC_1_MASK                      0x4
#define R73_SDA_PD_IC_1_SHIFT                     2
#define R73_SCL_PD_IC_1_MASK                      0x8
#define R73_SCL_PD_IC_1_SHIFT                     3
#define R73_SELFBOOT_PD_IC_1_MASK                 0x10
#define R73_SELFBOOT_PD_IC_1_SHIFT                4

/* PAD_CONTROL4 (IC 1) */
#define R74_DAC_SDATA_DRV_IC_1                    0x0    /* 0b	[0] */
#define R74_ADC_SDATA0_DRV_IC_1                   0x0    /* 0b	[1] */
#define R74_ADC_SDATA1_DRV_IC_1                   0x0    /* 0b	[2] */
#define R74_BCLK_DRV_IC_1                         0x0    /* 0b	[3] */
#define R74_LRCLK_DRV_IC_1                        0x0    /* 0b	[4] */
#define R74_DMIC0_1_DRV_IC_1                      0x0    /* 0b	[5] */
#define R74_DMIC2_3_DRV_IC_1                      0x0    /* 0b	[6] */
#define R74_DAC_SDATA_DRV_IC_1_MASK               0x1
#define R74_DAC_SDATA_DRV_IC_1_SHIFT              0
#define R74_ADC_SDATA0_DRV_IC_1_MASK              0x2
#define R74_ADC_SDATA0_DRV_IC_1_SHIFT             1
#define R74_ADC_SDATA1_DRV_IC_1_MASK              0x4
#define R74_ADC_SDATA1_DRV_IC_1_SHIFT             2
#define R74_BCLK_DRV_IC_1_MASK                    0x8
#define R74_BCLK_DRV_IC_1_SHIFT                   3
#define R74_LRCLK_DRV_IC_1_MASK                   0x10
#define R74_LRCLK_DRV_IC_1_SHIFT                  4
#define R74_DMIC0_1_DRV_IC_1_MASK                 0x20
#define R74_DMIC0_1_DRV_IC_1_SHIFT                5
#define R74_DMIC2_3_DRV_IC_1_MASK                 0x40
#define R74_DMIC2_3_DRV_IC_1_SHIFT                6

/* PAD_CONTROL5 (IC 1) */
#define R75_ADDR0_DRV_IC_1                        0x0    /* 0b	[0] */
#define R75_ADDR1_DRV_IC_1                        0x0    /* 0b	[1] */
#define R75_SDA_DRV_IC_1                          0x0    /* 0b	[2] */
#define R75_SCL_DRV_IC_1                          0x0    /* 0b	[3] */
#define R75_SELFBOOT_DRV_IC_1                     0x0    /* 0b	[4] */
#define R75_ADDR0_DRV_IC_1_MASK                   0x1
#define R75_ADDR0_DRV_IC_1_SHIFT                  0
#define R75_ADDR1_DRV_IC_1_MASK                   0x2
#define R75_ADDR1_DRV_IC_1_SHIFT                  1
#define R75_SDA_DRV_IC_1_MASK                     0x4
#define R75_SDA_DRV_IC_1_SHIFT                    2
#define R75_SCL_DRV_IC_1_MASK                     0x8
#define R75_SCL_DRV_IC_1_SHIFT                    3
#define R75_SELFBOOT_DRV_IC_1_MASK                0x10
#define R75_SELFBOOT_DRV_IC_1_SHIFT               4

/* ADC OPER (IC 1) */
#define R76_ADC_OPER_IC_1                         0xA0   /* 10100000b	[7:0] */
#define R76_ADC_OPER_IC_1_MASK                    0xFF
#define R76_ADC_OPER_IC_1_SHIFT                   0

#endif
